package com.teleran.base.lesson11;

/**
 * Класс это некий шаблон для построения объекта
 * ,можно сказать что это чертеж по которому будет создан объект
 * Описатель общих свойств объекта
 *
 * Классы и Объекты : Классы это набор файлов в нашем проекты , а
 * объекты это , мы создаем на основе этих файлов через слово new
 *
 * Класс - это чертеж автомобиля , где указаны его свойства и параметры
 * Объект - это реальний автомобиль, построеный по этому чертежу
 *
 * Объекты - это экземпляры какого то класа
 *
 * На основании одного класа мжно построить много объектов с различними характеристиками
 *
 * модификатор доступа class и имя класа
 * public class ClassExample {
 *      тело класа
 * }
 *
 */
public class ClassExample {
    // Элементы данных

    //Методы (поведение , которым обладает наш объект)

    //Конструкторы

    //вложенные классы

}
